# Video 1

In [32]:
import numpy as np
import pandas as pd

In [33]:
pd.Series(data=[10, 2, 3, 4], index=['a','b','c','d'])

a    10
b     2
c     3
d     4
dtype: int64

In [34]:
myD = {'e':20, 'f':200, 'g':2000, 'h':15}

In [35]:
myD

{'e': 20, 'f': 200, 'g': 2000, 'h': 15}

In [36]:
pd.Series(myD)

e      20
f     200
g    2000
h      15
dtype: int64

In [37]:
mySeriesOne = pd.Series([1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e'])

In [38]:
mySeriesOne

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [39]:
mySeriesTwo = pd.Series([1, 2, 7, 4, 2], ['a', 'b', 'c', 'f', 'e'])

In [40]:
mySeriesTwo

a    1
b    2
c    7
f    4
e    2
dtype: int64

In [41]:
mySeriesOne + mySeriesTwo

a     2.0
b     4.0
c    10.0
d     NaN
e     7.0
f     NaN
dtype: float64

In [42]:
mySeriesOne * mySeriesTwo

a     1.0
b     4.0
c    21.0
d     NaN
e    10.0
f     NaN
dtype: float64

In [43]:
mySeriesOne['a']

1

In [44]:
mySeriesOne[0]

1

# Video 2

In [45]:
from numpy.random import randn

In [46]:
myData = randn(3, 4)

In [47]:
myDataFrame = pd.DataFrame(myData, ['R1', 'R2', 'R3'], ['C1', 'C2', 'C3', 'C4'])

In [48]:
myDataFrame

          C1        C2        C3        C4
R1  0.215348  0.966944 -0.326682  0.670355
R2 -0.165598  0.284158  2.175588  1.638298
R3  0.738782  0.410368  0.681480 -0.281574

In [49]:
myDataFrame['C1']

R1    0.215348
R2   -0.165598
R3    0.738782
Name: C1, dtype: float64

In [50]:
myDataFrame[['C1','C2']]

          C1        C2
R1  0.215348  0.966944
R2 -0.165598  0.284158
R3  0.738782  0.410368

In [51]:
myDataFrame['C5'] = myDataFrame['C1'] + myDataFrame['C4']

In [52]:
myDataFrame

          C1        C2        C3        C4        C5
R1  0.215348  0.966944 -0.326682  0.670355  0.885703
R2 -0.165598  0.284158  2.175588  1.638298  1.472700
R3  0.738782  0.410368  0.681480 -0.281574  0.457208

In [53]:
myDataFrame.drop(['C2','C3'], axis=1)

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

In [54]:
myDataFrame

          C1        C2        C3        C4        C5
R1  0.215348  0.966944 -0.326682  0.670355  0.885703
R2 -0.165598  0.284158  2.175588  1.638298  1.472700
R3  0.738782  0.410368  0.681480 -0.281574  0.457208

In [55]:
myDataFrame.drop(['C2','C3'], axis=1, inplace=True)

In [56]:
myDataFrame

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

# Video 3

In [57]:
myDataFrame.loc['R1']

C1    0.215348
C4    0.670355
C5    0.885703
Name: R1, dtype: float64

In [58]:
myDataFrame.iloc[1]

C1   -0.165598
C4    1.638298
C5    1.472700
Name: R2, dtype: float64

In [59]:
myDataFrame.loc[['R1', 'R2'], ['C1', 'C4']]

          C1        C4
R1  0.215348  0.670355
R2 -0.165598  1.638298

In [60]:
myDataFrame

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

In [61]:
myDataFrame.iloc[[1, 2],[0, 1]]

          C1        C4
R2 -0.165598  1.638298
R3  0.738782 -0.281574

In [63]:
myDataFrame.loc[['R1', 'R2'], ['C1','C4']]

          C1        C4
R1  0.215348  0.670355
R2 -0.165598  1.638298

In [66]:
myDataFrame.iloc[[0, 1], [1, 2]]

          C4        C5
R1  0.670355  0.885703
R2  1.638298  1.472700

In [67]:
myDataFrame.loc[ ['R1', 'R3'], ['C1', 'C4']]

          C1        C4
R1  0.215348  0.670355
R3  0.738782 -0.281574

In [68]:
myDataFrame.loc[:'R3','C1':'C2']

          C1
R1  0.215348
R2 -0.165598
R3  0.738782

In [69]:
myDataFrame

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

In [70]:
myDataFrame.iloc[:1,1:]

          C4        C5
R1  0.670355  0.885703

# Video 4

In [71]:
myDataFrame

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

In [72]:
myDataFrame > 0

       C1     C4    C5
R1   True   True  True
R2  False   True  True
R3   True  False  True

In [73]:
myDataFrame[myDataFrame > 0]

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2       NaN  1.638298  1.472700
R3  0.738782       NaN  0.457208

In [74]:
myDataFrame

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

In [76]:
myDataFrame[myDataFrame['C4'] > 0]

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700

In [77]:
myDataFrame[myDataFrame['C1'] > 0]

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R3  0.738782 -0.281574  0.457208

In [78]:
myDataFrame[myDataFrame['C1'] != 0]

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

In [79]:
myDataFrame

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

# Video 5

In [80]:
myDataFrame

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

In [81]:
myDataFrame[myDataFrame['C1'] > 0]

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R3  0.738782 -0.281574  0.457208

In [93]:
myDataFrame[ (myDataFrame['C1'] > 0) & (myDataFrame['C4'] > 0)]

          C1        C4        C5
R1  0.215348  0.670355  0.885703

In [94]:
myDataFrame[ (myDataFrame['C1'] > 0) | (myDataFrame['C4'] > 0)]

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

In [96]:
True and False

False

In [104]:
5>0 and 5<0

False

In [116]:
[1, 2, 3] > [0, -1, 1]

True

In [123]:
myDataFrame[ (myDataFrame['C1'] > 0) & (myDataFrame['C4'] > 0) & (myDataFrame['C5'] > 0) ]

          C1        C4        C5
R1  0.215348  0.670355  0.885703

In [124]:
myDataFrame

          C1        C4        C5
R1  0.215348  0.670355  0.885703
R2 -0.165598  1.638298  1.472700
R3  0.738782 -0.281574  0.457208

In [125]:
myNewIndex = ['row1', 'row2', 'row3']

In [126]:
myNewIndex

['row1', 'row2', 'row3']

In [127]:
myDataFrame['NewIndex'] = myNewIndex

In [128]:
myDataFrame

          C1        C4        C5 NewIndex
R1  0.215348  0.670355  0.885703     row1
R2 -0.165598  1.638298  1.472700     row2
R3  0.738782 -0.281574  0.457208     row3

In [129]:
myDataFrame.set_index('NewIndex')

                C1        C4        C5
NewIndex
row1      0.215348  0.670355  0.885703
row2     -0.165598  1.638298  1.472700
row3      0.738782 -0.281574  0.457208

In [130]:
myDataFrame

          C1        C4        C5 NewIndex
R1  0.215348  0.670355  0.885703     row1
R2 -0.165598  1.638298  1.472700     row2
R3  0.738782 -0.281574  0.457208     row3

In [132]:
myDataFrame.set_index('NewIndex', inplace=True)

In [134]:
myDataFrame

                C1        C4        C5
NewIndex
row1      0.215348  0.670355  0.885703
row2     -0.165598  1.638298  1.472700
row3      0.738782 -0.281574  0.457208

In [135]:
NewIndex1 = ['column1', 'column2', 'column3']

In [136]:
NewIndex1

['column1', 'column2', 'column3']

In [140]:
myDataFrame.columns = NewIndex1

In [141]:
myDataFrame

           column1   column2   column3
NewIndex
row1      0.215348  0.670355  0.885703
row2     -0.165598  1.638298  1.472700
row3      0.738782 -0.281574  0.457208